In [1]:
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [13]:
#create a dataframe
df = pd.read_csv("salaries.csv")
df.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [11]:
#get the inputs and target values
inputs = df.drop('salary_more_then_100k', axis='columns')
target = df['salary_more_then_100k']

In [16]:
#since machine learning can only work with numbers, we have to convert the first 3 columns to numbers
from sklearn.preprocessing import LabelEncoder

le_company = LabelEncoder()
le_job = LabelEncoder()
le_degree = LabelEncoder()

In [19]:
#create columns in input dataframe
inputs['company_n'] = le_company.fit_transform(df['company'])
inputs['job_n'] = le_job.fit_transform(df['job'])
inputs['degree_n'] = le_degree.fit_transform(df['degree'])

inputs.head()

  company                  job     degree  company_n  job_n  degree_n
0  google      sales executive  bachelors          2      2         0
1  google      sales executive    masters          2      2         1
2  google     business manager  bachelors          2      0         0
3  google     business manager    masters          2      0         1
4  google  computer programmer  bachelors          2      1         0

In [23]:
#drop unnecessary columns
inputs_n = inputs.drop(['company', 'job', 'degree'], axis='columns')
inputs_n

    company_n  job_n  degree_n
0           2      2         0
1           2      2         1
2           2      0         0
3           2      0         1
4           2      1         0
5           2      1         1
6           0      2         1
7           0      1         0
8           0      0         0
9           0      0         1
10          1      2         0
11          1      2         1
12          1      0         0
13          1      0         1
14          1      1         0
15          1      1         1

In [33]:
#make and train the model
from sklearn import tree
model = tree.DecisionTreeClassifier()

In [38]:
#split the data to training and test datasets
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(inputs_n, target, test_size=0.1)
len(x_train)

14

In [41]:
#train the model
model.fit(inputs_n, target)

DecisionTreeClassifier()

In [51]:
#check the score of the model
model.score(x_test, y_test)

1.0

In [57]:
#make a prediction for someone working at google, a computer programmer and has degree
model.predict([[2, 1, 0]])

array([0], dtype=int64)